In [1]:
import pandas as pd
from sqlalchemy import create_engine, text
import psycopg2
pd.options.display.max_rows = 10
host="localhost"
database="Semana6_DE"
username="postgres"
with open("C:/Users/Windows/Downloads/pwd_postgre.txt",'r') as f:
    pwd= f.read()
port_id= '5432'

In [2]:
conn = psycopg2.connect(host=host, dbname=database, user=username, password=pwd, port=5432)
conn

In [3]:
from psycopg2 import Error
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        columns = [description[0] for description in cursor.description]
        result = cursor.fetchall()
        df = pd.DataFrame(result, columns=columns)
        return df
    except Error as e:
        print(f"Error '{e}' ha ocurrido")

**Pregunta 1**

Usando las tablas ```product``` y ```productreview```, JOIN y clasifica los productos de acuerdo con su calificación promedio de revisión. ¿Cuáles son los nombres y las identificaciones de los 5 productos principales

In [4]:
query = "SELECT BusinessEntityID, SalesYTD FROM SalesPerson ORDER BY SalesYTD DESC LIMIT 5;"
df = execute_query(conn, query)
df

   businessentityid      salesytd
0               276  4.251369e+06
1               289  4.116871e+06
2               275  3.763178e+06
3               277  3.189418e+06
4               290  3.121616e+06

**Pregunta 2**

Para su decepción, ¡solo hay tres productos con calificaciones y solo cuatro reseñas en total! Esto no es lo suficientemente cerca como para realizar un análisis de la correlación entre las revisiones y las ventas totales.

Sin embargo, su gerente quiere la descripción en inglés de estos productos para una próxima venta. ¡Utilice la documentación proporcionada anteriormente si necesita ayuda para navegar por la estructura para extraer esto!

In [5]:
query = """SELECT salespersonid, round(SUM(subtotal)) AS totalsales
FROM salesorderheader soh
WHERE soh.orderdate >= '2014-01-01'
AND soh.SalesPersonID is not NULL
GROUP BY SalesPersonID
ORDER BY TotalSales DESC
LIMIT 5;"""
df1 = execute_query(conn, query)
df1

   salespersonid  totalsales
0          289.0   1382997.0
1          276.0   1271089.0
2          275.0   1057247.0
3          282.0   1044811.0
4          277.0   1040093.0

In [6]:
conn.close()